# homebrew taps
tap "homebrew/bundle"
tap "homebrew/core"

brew "make" # required by powerlevel10k on linux
brew "gcc" # required by powerlevel10k, zsh on linux

# cli tools
brew "bat" # colorize man pages
brew "fd" # for telescope.nvim # fd-find
brew "fish"
brew "fisher" # fish package manager
brew "fzf"
brew "fx" # for json viewing
brew "git"
brew "gpg" # for signing git commits
brew "htop"
brew "jq"
brew "just"
tap "jesseduffield/lazygit/lazygit"
brew "lazygit"
brew "neovim"
brew "peak/tap/s5cmd" #s3 faster + sync
brew "ripgrep"
brew "rlwrap" # for cht.sh
brew "tig" # git history cli
brew "tldr"
brew "tmux"
brew "tree" # for showing recursive directory structure
brew "wget"
brew "bottom"

# cloud clis
brew "azure-cli"
brew "awscli"
tap "aws/tap"
# brew "eks-node-viewer"

# golang
brew "go"
brew "delve"

# node
brew "node"
brew "volta"
# brew "pnpm"

# python
brew "python3"
brew "pyenv"

# rust
brew "rustup"

# k8s
brew "helm"
brew "kind"
brew "krew"
brew "kubectl"
brew "kubectx"
tap "derailed/k9s"
brew "derailed/k9s/k9s"
brew "kubecolor"

# github
# brew "act" # for testing github actions
brew "gh"

# infrastructure
# brew "terraform"

# tilt
# brew install "tilt-dev/tap/tilt"
