# homebrew taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# zsh
brew "romkatv/powerlevel10k/powerlevel10k"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# fonts
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-jetbrains-mono"

# cli tools
brew "awscli"
brew "fzf"
brew "git"
brew "htop"
brew "jq"
brew "neovim"
brew "rlwrap" # for cht.sh
brew "tig" # git history cli
brew "tldr"
brew "tmux" 
brew "tree" # for showing recursive directory structure
brew "wget"
cask "session-manager-plugin" # AWS session manager

# useful macOS utilities
cask "alfred"
cask "bettertouchtool"
cask "dozer" 
cask "flux" # Night Shift does not work for multiple monitors
cask "monitorcontrol"
cask "rectangle"
cask "witch"

# software dev applications
cask "docker"
cask "iterm2"
cask "jetbrains-toolbox"
cask "postman"
cask "visual-studio-code"

# good web browsers
cask "firefox"
cask "google-chrome"

# other macOS applications
cask "spotify"

# golang
brew "go"

# node
brew "node@14"
brew "volta"
brew "yarn"

# python
brew "pyenv"

# grpc
# brew "grpc"
# brew "protobuf"

# dotnet
# cask "dotnet-sdk"

# java
# tap "adoptopenjdk/openjdk"
# brew "gradle"
# cask "adoptopenjdk11"

# jmeter
# brew "jmeter"

# infrastructure
# brew "opa"
# brew "terraform"
# brew "terragrunt"

# k8s
# tap "derailed/k9s"
# tap "derailed/popeye"
# tap "tilt-dev/tap"
# brew "aws-iam-authenticator"
# brew "derailed/k9s/k9s"
# brew "derailed/popeye/popeye"
# brew "helm"
# brew "kind"
# brew "kubernetes-cli"
# brew "minikube"
# brew "skaffold"
# brew "stern"
# brew "tilt-dev/tap/tilt"
# cask "kubernetic"

# react native / mobile development
# tap "facebook/fb"
# tap "wix/brew"
# cask "react-native-debugger"
# brew "wix/brew/applesimutils"
# brew 'watchman'
# brew "facebook/fb/idb-companion"

# Most likely dependencies of above, or currently unused
# brew "autoconf"
# brew "automake"
# brew "coreutils"
# brew "gcc"
# brew "glib"
# brew "libtool"
# brew "imagemagick"
# brew "libevent"
# brew "libksba"
# brew "libyaml"
# brew "pkg-config"
# brew "ruby"
# brew "unzip"
# brew "zlib"
