# homebrew taps
tap "homebrew/bundle"
tap "homebrew/core"

brew "make" # required by powerlevel10k on linux
brew "gcc" # required by powerlevel10k, zsh on linux

# zsh
tap "romkatv/powerlevel10k"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "zsh" # macOS ships with an ancient version by default
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"

# cli tools
brew "bat" # colorize man pages
brew "fd" # for telescope.nvim
brew "fzf"
brew "fx" # for json viewing
brew "git"
brew "gpg" # for signing git commits
brew "htop"
brew "jq"
brew "just"
brew "neovim"
brew "ripgrep"
brew "rlwrap" # for cht.sh
brew "tig" # git history cli
brew "tldr"
brew "tmux" 
brew "tree" # for showing recursive directory structure
brew "wget"

# cloud clis
brew "azure-cli"
brew "awscli"
tap "aws/tap"
brew "eks-node-viewer"

# golang
brew "go"
brew "delve"
tap "golangci/tap" # from Learn Go with tests
brew "golangci/tap/golangci-lint" # from Learn Go with tests

# node
brew "volta"
brew "pnpm"

# python
brew "pyenv"

# rust
brew "rustup"

# k8s
brew "helm"
brew "kind"
brew "krew"
brew "kubectl"
brew "kubectx"
tap "derailed/k9s"
brew "derailed/k9s/k9s"

# github cli
brew "act" # for testing github actions
brew "gh"

# infrastructure
brew "terraform"

# tilt
brew install "tilt-dev/tap/tilt"
